<?php

return [
    'menu'        => [
        'program'              => 'Учебная программа',
        'levels'               => 'Уровни',
        'lessons'              => 'Уроки',
        'lesson_element_types' => 'Типы элементов урока',
        'lesson_elements'      => 'Элементы урока',
    ],
    'pages'       => [
        'level'                => [
            'index'  => 'Уровни',
            'create' => 'Создание уровня',
            'update' => 'Редактирование уровня',
            'show'   => 'Уровень',
            'delete' => 'Удаление уровня'
        ],
        'lesson'               => [
            'index'  => 'Уроки',
            'create' => 'Создание урока',
            'update' => 'Редактирование урока',
            'show'   => 'Урок',
            'delete' => 'Удаление урока'
        ],
        'lesson_element_types' => [
            'index'  => 'Типы элементов урока',
            'create' => 'Создание типа элемента урока',
            'update' => 'Редактирование типа элемента урока',
            'show'   => 'Тип элемента урока',
            'delete' => 'Удаление типа элемента урока'
        ],
        'lesson_elements'      => [
            'index'  => 'Элементы урока',
            'create' => 'Создание элемента урока',
            'update' => 'Редактирование элемента урока',
            'show'   => 'Элемент урока',
            'delete' => 'Удаление элемента урока'
        ]
    ],
    'links'       => [
        'index'  => 'Список',
        'create' => 'Создать',
        'update' => 'Редактировать',
        'show'   => 'Показать',
        'delete' => 'Удалить'
    ],
    'models'      => [
        'level'                => [
            'code'     => 'Код',
            'title'    => 'Название',
            'priority' => 'Приоритет'
        ],
        'lesson'               => [
            'order' => 'Порядок',
            'title' => 'Название',
            'level' => 'Уровень',
        ],
        'lesson_elements'      => [
            'icon'         => 'Иконка',
            'element_type' => 'Тип',
            'title'        => 'Название',
            'description'  => 'Описание'
        ],
        'lesson_element_types' => [
            'slugs'       => [
                '' => [
                    'title'       => 'Прочитай та переклади',
                    'description' => 'Прочитай текст вголос і спробуй перекласти.  Якщо трапляється незнайоме слово- ти завжди можеш подивитись його у словнику!'
                ]
            ],
            'title'       => 'Название',
            'description' => 'Описание'
        ],
        'default'              => [
            'created_at' => 'Дата создания',
            'updated_at' => 'Последнее редактирование'
        ]
    ],
    'permissions' => [
        'lessons'              => 'Уроки',
        'levels'               => 'Уровни',
        'lesson_element_types' => 'Типы элементов урока',
        'lesson_elements'      => 'Элементы урока',
    ],
    'roles'       => [
        'study' => 'Учебная программа'
    ],
    'toasts'      => [
        'actions' => [
            'saved'   => 'Запись сохранена',
            'deleted' => 'Запись удалена',
        ]
    ]
];
