<?php

return [
    'menu'        => [
        'program'              => 'Учебная программа',
        'levels'               => 'Уровни',
        'lessons'              => 'Уроки',
        'lesson_element_types' => 'Типы элементов урока',
        'lesson_elements'      => 'Элементы урока',
        'dictionary'           => [
            'dictionary' => 'Словарь',
            'words'      => 'Слова'
        ],
        'packages'       => 'Пакеты',
        'payments'       => 'Оплаты',
        'schedule'             => [
            'schedule'    => 'Календарь',
            'event_types' => 'Типы событий'
        ]
    ],
    'pages'       => [
        'event_types'          => [
            'index'  => 'Типы событий',
            'create' => 'Создание типа собития',
            'update' => 'Редактирование типа события',
            'show'   => 'Тип события',
            'delete' => 'Удаление типа события'
        ],
        'package_add'                => [
            'index'  => 'Доп Пакеты',
            'create' => 'Создание доп пакета',
            'update' => 'Редактирование доп пакета',
            'show'   => 'Доп Пакет',
            'delete' => 'Удаление доп пакета'
        ],
        'package'                => [
            'index'  => 'Пакеты',
            'create' => 'Создание пакета',
            'update' => 'Редактирование пакета',
            'show'   => 'Пакет',
            'delete' => 'Удаление пакета'
        ],
        'payment'                => [
            'index'  => 'Оплаты',
            'create' => 'Создание оплаты',
            'update' => 'Редактирование оплаты',
            'show'   => 'Оплата',
            'delete' => 'Удаление оплаты'
        ],
        'news'                => [
            'index'  => 'Новости',
            'create' => 'Создание новости',
            'update' => 'Редактирование новости',
            'show'   => 'Новость',
            'delete' => 'Удаление новости'
        ],
        'level'                => [
            'index'  => 'Уровни',
            'create' => 'Создание уровня',
            'update' => 'Редактирование уровня',
            'show'   => 'Уровень',
            'delete' => 'Удаление уровня'
        ],
        'lesson'               => [
            'index'  => 'Уроки',
            'create' => 'Создание урока',
            'update' => 'Редактирование урока',
            'show'   => 'Урок',
            'delete' => 'Удаление урока'
        ],
        'lesson_element_types' => [
            'index'  => 'Типы элементов урока',
            'create' => 'Создание типа элемента урока',
            'update' => 'Редактирование типа элемента урока',
            'show'   => 'Тип элемента урока',
            'delete' => 'Удаление типа элемента урока'
        ],
        'lesson_elements'      => [
            'index'  => 'Элементы урока',
            'create' => 'Создание элемента урока',
            'update' => 'Редактирование элемента урока',
            'show'   => 'Элемент урока',
            'delete' => 'Удаление элемента урока'
        ],
        'word'                 => [
            'index'  => 'Слова',
            'create' => 'Создание слова',
            'update' => 'Редактирование слова',
            'show'   => 'Слово',
            'delete' => 'Удаление слова'
        ],
    ],
    'links'       => [
        'index'  => 'Список',
        'create' => 'Создать',
        'update' => 'Редактировать',
        'show'   => 'Показать',
        'delete' => 'Удалить'
    ],
    'actions'     => [
        'add_item'    => 'Добавить :item',
        'remove_item' => 'Удалить :item'
    ],
    'models'      => [
        'package'                => [
            'icon'     => 'Изображение',
            'price'    => 'Цена',
            'type'     => 'Тип',
            'status'   => 'Статус',
            'title'    => 'Название',
            'description'  => 'Описание'
        ],
        'payment'           => [
            'user_id'       => 'Пользователь',
            'package_id'    => 'Пакет',
            'amount'        => 'Сумма',
            'amount_type'   => 'Оплата с',
            'status'        => 'Статус',
            'active_before' => 'Активен до',
        ],
        'level'                => [
            'code'     => 'Код',
            'title'    => 'Название',
            'priority' => 'Приоритет'
        ],
        'lesson'               => [
            'order'    => 'Порядок',
            'title'    => 'Название',
            'level'    => 'Уровень',
            'elements' => 'Элементы'
        ],
        'lesson_elements'      => [
            'icon'         => 'Иконка',
            'element_type' => 'Тип',
            'title'        => 'Название',
            'description'  => 'Описание'
        ],
        'lesson_element_types' => [
            'slugs'            => [
                'read_and_translate'     => [
                    'title'       => 'Прочитай та переклади',
                    'description' => 'Прочитай текст вголос і спробуй перекласти.  Якщо трапляється незнайоме слово- ти завжди можеш подивитись його у словнику!'
                ],
                'read_and_insert'        => [
                    'title'       => 'Прочитай та впиши пропущені слова у тексті',
                    'description' => 'Прочитай текст вголос і спробуй перекласти.  Якщо трапляється незнайоме слово- ти завжди можеш подивитись його у словнику!'
                ],
                'read_and_answer'        => [
                    'title'       => 'Прочитай та дай відповіді на питання після тексту',
                    'description' => 'Прочитай текст вголос і спробуй перекласти.  Якщо трапляється незнайоме слово- ти завжди можеш подивитись його у словнику!'
                ],
                'translate_words'        => [
                    'title'       => 'Перекладіть слова',
                    'description' => 'Запишіть німецькою, що бачите на картинці'
                ],
                'watch_video_and_answer' => [
                    'title'       => 'Перегляньте відео та дайте відповіді на запитання',
                    'description' => 'Запишіть німецькою, що бачите на картинці'
                ]
            ],
            'title'            => 'Название',
            'description'      => 'Описание',
            'text'             => 'Текст',
            'image'            => 'Изображение',
            'video'            => 'Видео',
            'previously_video' => 'Предыдущее видео',
            'word'             => 'Слово',
            'question'         => 'Вопрос',
            'words'            => 'Слова',
            'answer'           => 'Ответ'
        ],
        'word'                 => [
            'word'                         => 'Слово',
            'description'                  => 'Описание',
            'image'                        => 'Изображение',
            'word_translation'             => 'Перевод слова',
            'word_description_translation' => 'Перевод описания'
        ],
        'default'              => [
            'created_at' => 'Дата создания',
            'updated_at' => 'Последнее редактирование'
        ],
        'event_types'          => [
            'title' => 'Название'
        ]
    ],
    'permissions' => [
        'lessons'              => 'Уроки',
        'levels'               => 'Уровни',
        'lesson_element_types' => 'Типы элементов урока',
        'lesson_elements'      => 'Элементы урока',
        'dictionary'           => 'Словарь',
        'event_types'          => 'Типы событий'
    ],
    'roles'       => [
        'study'    => 'Учебная программа',
        'schedule' => 'Календарь'
    ],
    'toasts'      => [
        'actions' => [
            'saved'   => 'Запись сохранена',
            'deleted' => 'Запись удалена',
        ]
    ]
];
