<?php

return [
    'menu'        => [
        'program'              => 'Навчальна програма',
        'levels'               => 'Рівні',
        'lessons'              => 'Уроки',
        'lesson_element_types' => 'Типи елементів уроку',
        'lesson_elements'      => 'Елементи уроку',
        'dictionary'           => [
            'dictionary' => 'Словник',
            'words'      => 'Слова'
        ],
        'packages'       => 'Курси',
        'payments'       => 'Оплати',
        'schedule'             => [
            'schedule'    => 'Календар',
            'event_types' => 'Типи подій'
        ]
    ],
    'pages'       => [
        'event_types'          => [
            'index'  => 'Типи подій',
            'create' => 'Створення типу події',
            'update' => 'Редагування типу події',
            'show'   => 'Типи події',
            'delete' => 'Видалення типу події'
        ],
        'package'                => [
            'index'  => 'Курси',
            'create' => 'Створення курсу',
            'update' => 'Редагування курсу',
            'show'   => 'Курс',
            'delete' => 'Видалення курсу'
        ],
        'payment'                => [
            'index'  => 'Оплати',
            'create' => 'Створення оплати',
            'update' => 'Редагування оплати',
            'show'   => 'Оплата',
            'delete' => 'Видалення оплати'
        ],
        'news'                => [
            'index'  => 'Новини',
            'create' => 'Створення новини',
            'update' => 'Редагування новини',
            'show'   => 'Новина',
            'delete' => 'Видалення новини'
        ],
        'level'                => [
            'index'  => 'Рівні',
            'create' => 'Створення рівня',
            'update' => 'Редагування рівня',
            'show'   => 'Рівень',
            'delete' => 'Видалення рівня'
        ],
        'lesson'               => [
            'index'  => 'Уроки',
            'create' => 'Створення уроку',
            'update' => 'Редагування уроку',
            'show'   => 'Урок',
            'delete' => 'Видалення уроку'
        ],
        'lesson_element_types' => [
            'index'  => 'Типи елементів уроку',
            'create' => 'Створення типу елемента уроку',
            'update' => 'Редагування типу елемента уроку',
            'show'   => 'Тип елемента уроку',
            'delete' => 'Видалення типу елемента уроку'
        ],
        'lesson_elements'      => [
            'index'  => 'Елементи уроку',
            'create' => 'Створення елемента уроку',
            'update' => 'Редагування елемента уроку',
            'show'   => 'Елемент уроку',
            'delete' => 'Видалення елемента уроку'
        ],
        'word'                 => [
            'index'  => 'Слова',
            'create' => 'Створення слова',
            'update' => 'Редагування слова',
            'show'   => 'Слово',
            'delete' => 'Видалення слова'
        ]
    ],
    'links'       => [
        'index'  => 'Список',
        'create' => 'Створити',
        'update' => 'Редагувати',
        'show'   => 'Показати',
        'delete' => 'Видалити'
    ],
    'actions'     => [
        'add_item'    => 'Додати :item',
        'remove_item' => 'Видалити :item'
    ],
    'models'      => [
        'package'                => [
            'icon'     => 'Зображення ',
            'price'    => 'Ціна',
            'type'     => 'Тип',
            'status'   => 'Статус',
            'title'    => 'Назва',
            'description'  => 'Опис'
        ],
        'payment'           => [
            'user_id'       => 'Користувач',
            'package_id'    => 'Пакет',
            'amount'        => 'Сума',
            'amount_type'   => 'Оплата з',
            'status'        => 'Статус',
            'active_before' => 'Активний до',
        ],
        'level'                => [
            'code'     => 'Код',
            'title'    => 'Назва',
            'priority' => 'Пріорітет'
        ],
        'lesson'               => [
            'order'    => 'Порядок',
            'title'    => 'Назва',
            'level'    => 'Рівень',
            'elements' => 'Елементи'
        ],
        'lesson_elements'      => [
            'icon'         => 'Іконка',
            'element_type' => 'Тип',
            'title'        => 'Назва',
            'description'  => 'Опис'
        ],
        'lesson_element_types' => [
            'slugs'            => [
                'read_and_translate'     => [
                    'title'       => 'Прочитай та переклади',
                    'description' => 'Прочитай текст вголос і спробуй перекласти.  Якщо трапляється незнайоме слово- ти завжди можеш подивитись його у словнику!'
                ],
                'read_and_insert'        => [
                    'title'       => 'Прочитай та впиши пропущені слова у тексті',
                    'description' => 'Прочитай текст вголос і спробуй перекласти.  Якщо трапляється незнайоме слово- ти завжди можеш подивитись його у словнику!'
                ],
                'read_and_answer'        => [
                    'title'       => 'Прочитай та дай відповіді на питання після тексту',
                    'description' => 'Прочитай текст вголос і спробуй перекласти.  Якщо трапляється незнайоме слово- ти завжди можеш подивитись його у словнику!'
                ],
                'translate_words'        => [
                    'title'       => 'Перекладіть слова',
                    'description' => 'Запишіть німецькою, що бачите на картинці'
                ],
                'watch_video_and_answer' => [
                    'title'       => 'Перегляньте відео та дайте відповіді на запитання',
                    'description' => 'Запишіть німецькою, що бачите на картинці'
                ]
            ],
            'title'            => 'Назва',
            'description'      => 'Опис',
            'text'             => 'Текст',
            'image'            => 'Зображення',
            'video'            => 'Відео',
            'previously_video' => 'Попереднє відео',
            'word'             => 'Слово',
            'question'         => 'Питання',
            'words'            => 'Слова',
            'answer'           => 'Відповідь'
        ],
        'word'                 => [
            'word'                         => 'Слово',
            'description'                  => 'Опис',
            'image'                        => 'Зображення',
            'word_translation'             => 'Переклад слова',
            'word_description_translation' => 'Переклад опису'
        ],
        'default'              => [
            'created_at' => 'Дата створення',
            'updated_at' => 'Останнє редагування'
        ],
        'event_types'          => [
            'title' => 'Назва',
        ]
    ],
    'permissions' => [
        'lessons'              => 'Уроки',
        'levels'               => 'Рівні',
        'lesson_element_types' => 'Типи елементів уроку',
        'lesson_elements'      => 'Елементи уроку',
        'dictionary'           => 'Словник',
        'event_types'          => 'Типи подій'
    ],
    'roles'       => [
        'study'    => 'Навчальна програма',
        'schedule' => 'Календар'
    ],
    'toasts'      => [
        'actions' => [
            'saved'   => 'Запис збережено',
            'deleted' => 'Запис видалено',
        ]
    ]
];
